# DpartBaseLevelByOriginal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartBaseLevelByOriginal Property
ParameterTypeId Class See Also
---
"Base Level By Original"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartBaseLevelByOriginal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartBaseLevelByOriginal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartBaseLevelByOriginal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace